{
  "backend/main.mo": "Main Motoko actor implementing a recovery companion app with user profiles, check-ins, medications, dose logs, meetings, emergency contacts, commitments plans, and NFL Combine tracking with public/private entries and role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: verifying the Published feed displays all public combine entries (REQ-1) and adding sorting/leaderboard capability to the Published feed (REQ-3).",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend source files covering the NFL Combine tracker app with guest/authenticated modes, recovery program features, medication tracking, check-ins, and combine entry management with localStorage and React Query hooks.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based color system defining design tokens for light and dark modes with athletic-themed blue/purple primary colors.",
  "frontend/index.html": "HTML entry point for NFL Combine Tracker with PWA manifest, iOS support, meta tags, and theme color configuration.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, and standalone display mode for NFL Combine Tracker.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls with cache fallback, plus cache versioning and cleanup.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining routes for landing, dashboard, new entry, history, entry detail, share card, public entry, and published feed with authentication-aware layout and profile setup dialog.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with authentication state management and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup requiring name input before accessing the app, with form validation and mutation handling.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file placeholder for check-in editor component.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file placeholder for check-in trends component.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Displays a badge and description comparing a drill value to benchmark levels (elite, above-average, average, below-average) with reference values shown.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "Form component for entering NFL combine data including athlete info, measurements, and drill results with validation and error handling.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "SVG-based line chart component that visualizes combine metric trends over time with improvement indicators.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Panel displaying trend charts for 40-yard dash, vertical jump, and bench press metrics from multiple combine entries.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, navigation, footer, and authentication status display; includes guest mode badge.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file with no content.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file with no content.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file with no content.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file with no content.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file with no content.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCombine.ts": "Custom hooks for CRUD operations on combine entries, supporting both authenticated users (via actor) and guest mode (via local storage).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving user profiles via the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, muted, destructive, and sidebar variants.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty page component file.",
  "frontend/src/pages/CheckIns.tsx": "Empty page component file.",
  "frontend/src/pages/combine/Dashboard.tsx": "Dashboard page displaying combine entry statistics, quick action cards for new entry/history/published, latest entry summary, and trends panel.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Detail view for a single combine entry showing all drill results, measurements, benchmark comparisons, and actions for toggling public visibility, sharing, and deletion.",
  "frontend/src/pages/combine/History.tsx": "Displays a paginated list of the authenticated user's combine entries with navigation to individual entry details and a back button to the dashboard.",
  "frontend/src/pages/combine/NewEntry.tsx": "Provides a form for creating a new combine entry, validates and parses the input data, then saves it via mutation and navigates to the entry detail page.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Displays a public combine entry with performance results and benchmark comparisons, accessible via a public URL without authentication.",
  "frontend/src/pages/combine/Published.tsx": "Shows a leaderboard of all public combine entries with sortable metrics (40-yard dash, vertical jump, etc.) and navigation to individual public entries.",
  "frontend/src/pages/combine/ShareCard.tsx": "Generates a shareable card view of a combine entry with copy-to-clipboard functionality for public entries and screenshot instructions for private/guest entries.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty page component file.",
  "frontend/src/pages/Landing.tsx": "Landing page showcasing NFL Combine Tracker features with login/guest options, hero section, and feature cards for tracking athletic performance.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty page component file.",
  "frontend/src/pages/Medications.tsx": "Empty page component file.",
  "frontend/src/pages/Meetings.tsx": "Empty page component file.",
  "frontend/src/pages/Onboarding.tsx": "Empty page component file.",
  "frontend/src/pages/Program.tsx": "Empty page component file.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty page component file.",
  "frontend/src/pages/Settings.tsx": "Empty page component file.",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty page component file.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty page component file.",
  "frontend/src/pages/Today.tsx": "Empty page component file.",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark thresholds (elite, good, average) for each combine drill and provides a comparison function to categorize performance levels.",
  "frontend/src/utils/combineGuestStorage.ts": "Manages localStorage-based CRUD operations for guest (unauthenticated) combine entries with auto-incrementing IDs and timestamp tracking.",
  "frontend/src/utils/combineSorting.ts": "Defines sorting logic for combine entries with multiple metrics (speed drills ascending, strength/jump descending) and exports sort options for UI display.",
  "frontend/src/utils/combineValidation.ts": "Provides form validation for combine data entry with field-specific min/max ranges and helper functions to parse optional numeric inputs.",
  "frontend/src/utils/exporters.ts": "Empty file, likely placeholder for future export functionality.",
  "frontend/src/utils/reminders.ts": "Empty file, likely placeholder for future reminder functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/src/utils/userScopedStorage.ts": "Empty file, likely placeholder for user-specific storage functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme tokens for sidebar/charts, custom animations, and typography/container plugins.",
  "project_state.json": "Project metadata tracking NFL Combine Tracker features, including existing leaderboard sorting and pending action items to verify public feed displays all users' entries."
}