{
  "backend/main.mo": "Main Motoko actor defining data types, access control, and user-scoped storage plus functions for profiles, commitments plans, and other recovery-related records.",
  "backend/migration.mo": "Migration module converting old actor state to the new format by adding an empty commitmentsPlans map while preserving other maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of key frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "TailwindCSS base style file defining color tokens, theme variables, and global styles for light and dark modes.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Application router configuring all routes, authentication gating, profile setup flow, and layout structure.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users to enter their name and saving the profile through backend mutations.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Form for creating or updating today's check‑in, preloading existing data and submitting via mutation.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Displays 7‑ and 30‑day averages and trends for stress and work hours using check‑in history.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, navigation tabs, footer, and user profile integration.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Shows today's scheduled doses, their statuses, and allows logging taken, skipped, or late doses.",
  "frontend/src/components/medications/MedicationForm.tsx": "Form for adding a new medication with dose, schedule times, instructions, and prescriber info.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Form for logging a meeting with date, time, format, notes, and goals, submitted via mutation.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Displays sponsor contact notes from meetings, filtering and sorting them by date and rendering them in a styled card.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Provides a form to view and edit a user's commitments plan with autosave indicators and mutation-based saving.",
  "frontend/src/components/safety/Disclaimers.tsx": "Renders a list of safety and responsibility disclaimers with icons for emphasis.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, identity loading, and logout behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider contexts.",
  "frontend/src/pages/AdherenceHistory.tsx": "Displays medication adherence metrics for 7 and 30 days and groups dose logs by day with status badges.",
  "frontend/src/pages/CheckIns.tsx": "Shows daily check-ins with tabs for today, history grouped by month, and trend visualization.",
  "frontend/src/pages/CrisisHelp.tsx": "Provides crisis guidance, emergency resources, and an interface to manage emergency contacts.",
  "frontend/src/pages/Landing.tsx": "Landing page presenting app features, hero section, and navigation to login and crisis help.",
  "frontend/src/pages/MedicationDetail.tsx": "Displays detailed medication info including schedule, instructions, prescriber, and active status.",
  "frontend/src/pages/Medications.tsx": "Displays active and archived medications, provides stats and an add-medication dialog, and renders medication cards and empty states.",
  "frontend/src/pages/Meetings.tsx": "Shows meeting history and sponsor notes with tab navigation, sorted meeting logs, and a dialog to add new meetings.",
  "frontend/src/pages/Onboarding.tsx": "Guides users through a three‑step onboarding flow, collecting goals, work hours, and preferences before saving settings.",
  "frontend/src/pages/Program.tsx": "Lists recovery steps, shows completion progress, and lets users navigate into individual step details.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Displays details for a single recovery step, shows existing reflections, and allows saving new reflections.",
  "frontend/src/pages/Settings.tsx": "Provides settings for reminders, data export, crisis help, and disclaimers, allowing updates to user preferences.",
  "frontend/src/pages/SettingsDataExport.tsx": "Provides UI for exporting user data as JSON or a text summary, using export utilities and navigation.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Renders a safety planning page with crisis resources, a pause-and-plan checklist, and a commitments editor.",
  "frontend/src/pages/Today.tsx": "Displays today's medication schedule, overdue/upcoming doses, and check-in status using user settings and queries.",
  "frontend/src/utils/exporters.ts": "Implements functions to export user data to downloadable JSON or a text-based summary file.",
  "frontend/src/utils/reminders.ts": "Calculates overdue and upcoming medication doses based on schedules, logs, and current time.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/userScopedStorage.ts": "Manages loading, saving, and clearing per-user settings in localStorage with defaults.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH-based theme extensions, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s state metadata and a list of existing features related to recovery, medication management, and user safety."
}