{
  "backend/main.mo": "Main actor defining types and state for a recovery/wellness app with check-ins, medications, meetings, emergency contacts, and an NFL combine tracker with detailed measurements; includes authorization mixin and CRUD operations for all entities.",
  "backend/migration.mo": "Migration module converting old CombineResult schema (simple optional fields) to new schema with CombineMeasurement objects containing value, verification status, notes, attempt number, equipment used, and measurement type for all NFL combine statistics.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: comprehensive NFL combine input form, detailed entry display views, leaderboard with usernames and rankings, benchmark comparison for all statistics, and guest mode localStorage support for all measurements.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including routing, landing page, recovery program pages, onboarding flow, storage utilities, reminder logic, export tools, safety disclaimers, check-in trends, medication tracking, adherence history, styling, commitments editor, React Query hooks, app shell, guest storage, validation, and benchmark utilities.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based design tokens defining light and dark mode color schemes using athletic blue/purple theming for primary colors, plus sidebar, chart, and semantic color variables.",
  "frontend/index.html": "HTML entry point with PWA manifest, iOS web app meta tags, apple-touch-icon, theme color, and description for NFL Combine Tracker application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, description, display mode (standalone), theme colors, orientation, and icon assets for 192x192 and 512x512 sizes with maskable purpose.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls, with install/activate lifecycle handlers for cache management and offline fallback support.",
  "frontend/src/App.tsx": "Main app component that sets up TanStack Router with routes for landing, dashboard, entry management, and public sharing pages. Includes authentication check, profile setup dialog, theme provider, and toast notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, displays appropriate state (signing in, signed in/out), and clears query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup that prompts for name input and saves the profile using a mutation hook.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file placeholder for check-in editor component.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file placeholder for check-in trends component.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Displays performance level badges and benchmark comparisons for NFL combine drill results, showing elite/good/average thresholds with appropriate styling.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "Comprehensive form component for entering NFL combine measurements including body metrics, speed drills, strength tests, and agility drills with validation and error handling.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "SVG-based line chart component that visualizes performance trends over time for combine metrics, showing improvement direction and data points with values.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Panel component that displays multiple trend charts for key combine metrics (40-yard dash, vertical jump, bench press) extracted from entry history.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper with header (logo, user info, login button), navigation tabs, main content area, and footer with attribution links.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file placeholder for medication dose checklist component.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file placeholder for medication form component.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file placeholder for meeting form component.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file placeholder for sponsor notes component.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file placeholder for commitments plan editor component.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file placeholder for disclaimers component.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useCombine.ts": "React Query hooks for managing combine entries (CRUD operations) with support for both authenticated users (via actor) and guest users (via local storage). Includes helpers to create measurement objects and invalidate queries on mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle. Provides status tracking (initializing, logging-in, success, error) and identity access throughout the app.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving user profiles, including caller profile, single user profile by Principal, and batch fetching multiple user profiles. All queries depend on the actor being available.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty page component file (no content).",
  "frontend/src/pages/CheckIns.tsx": "Empty page component file (no content).",
  "frontend/src/pages/combine/Dashboard.tsx": "Combine dashboard page displaying quick action cards (New Entry, History, Published), entry count, and latest entry summary with key measurements (40-yard dash, vertical jump, etc.). Includes navigation to related pages.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Displays detailed view of a combine entry with measurements, drills, and actions (toggle public/private, delete, share). Includes benchmark comparison and handles authentication-based permissions.",
  "frontend/src/pages/combine/History.tsx": "Lists all user's combine entries in a card grid with key stats (40-yard, vertical, bench, broad jump) and timestamps. Each card is clickable to navigate to entry detail.",
  "frontend/src/pages/combine/NewEntry.tsx": "Form page for creating a new combine entry. Parses and validates form data, saves via mutation, and navigates to the newly created entry detail on success.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Public-facing view of a combine entry accessible without authentication. Displays measurements, speed drills, power drills, and strength tests with benchmark comparisons.",
  "frontend/src/pages/combine/Published.tsx": "Leaderboard page showing all public combine entries with sortable metrics (40-yard, vertical, bench, etc.). Fetches user profiles to display athlete names and includes ranking indicators.",
  "frontend/src/pages/combine/ShareCard.tsx": "Generates a shareable card view of a combine entry with key stats. Provides copy-to-clipboard link for public entries or screenshot instructions for private/guest entries.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Landing.tsx": "Landing page component showcasing NFL Combine Tracker features with hero section, feature cards (Track Performance, Monitor Progress, Compare Benchmarks, Share Results), and options to login or continue as guest.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Medications.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Meetings.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Onboarding.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Program.tsx": "Empty page component file (no content).",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Settings.tsx": "Empty page component file (no content).",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty page component file (no content).",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty page component file (no content).",
  "frontend/src/pages/Today.tsx": "Empty page component file (no content).",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark thresholds (elite, good, average) for NFL combine drills and measurements, and provides a comparison function to evaluate athlete performance against these standards.",
  "frontend/src/utils/combineGuestStorage.ts": "Manages localStorage-based persistence for guest user combine entries, providing CRUD operations (load, save, update, delete) without requiring authentication.",
  "frontend/src/utils/combineSorting.ts": "Provides sorting logic for combine entries by various metrics (recent, 40-yard dash, vertical jump, etc.) with proper handling of ascending/descending order based on metric type.",
  "frontend/src/utils/combineValidation.ts": "Validates combine form data with field-specific min/max ranges for all NFL combine statistics and provides parsing utilities for optional numeric inputs.",
  "frontend/src/utils/exporters.ts": "Empty utility file, likely intended for future data export functionality.",
  "frontend/src/utils/reminders.ts": "Empty utility file, likely intended for future reminder/notification functionality.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, persisting, and managing URL parameters across hash-based and browser routing, with sessionStorage integration for parameter persistence.",
  "frontend/src/utils/userScopedStorage.ts": "Empty utility file, likely intended for future user-specific storage functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, animations, and design tokens for a modern UI with dark mode support.",
  "project_state.json": "Project metadata tracking implemented features for NFL combine statistics tracking, including comprehensive data fields, leaderboard ranking, benchmark comparisons, and guest mode support."
}