{
  "backend/main.mo": "Main Motoko actor implementing a recovery and wellness tracking system with authorization, user profiles, check-ins, reflections, medications, dose logs, meetings, emergency contacts, commitments plans, and an NFL Combine results tracking feature with public/private entries.",
  "feature_evidence.json": "Feature evidence report documenting PWA implementation including manifest file, service worker, icon generation, and iOS-specific meta tags with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files covering NFL Combine tracker pages, recovery program components, medication tracking, guest/authenticated flows, utilities for storage/validation/benchmarks, and React Query hooks.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based design tokens defining light and dark mode color schemes using CSS custom properties for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with PWA manifest link, iOS-specific meta tags for standalone app capability, theme color, and apple-touch-icon reference for optimal mobile web app experience.",
  "frontend/public/manifest.json": "PWA manifest defining NFL Combine Tracker app metadata including name, description, standalone display mode, theme colors, portrait orientation, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls, with install/activate/fetch event handlers for offline functionality and cache management.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining routes for landing, dashboard, new entry, history, entry detail, share card, public entry, and published feed; includes authentication check, profile setup dialog, and theme provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component using Internet Identity hook to handle sign-in/sign-out with loading states, query cache clearing on logout, and error handling for duplicate authentication attempts.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog component that prompts new users to enter their name during initial profile setup, preventing dismissal until completed.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file with no content.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file with no content.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Displays performance benchmarks for NFL combine drills, showing how a value compares to elite, good, and average standards with color-coded badges.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "A comprehensive form component for entering NFL combine measurements and drill results, including athlete info, physical measurements, and performance drills with validation.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "An SVG-based line chart component that visualizes performance trends over time for combine metrics, showing improvement direction and data points.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Displays multiple trend charts for key combine metrics (40-yard dash, vertical jump, bench press) by aggregating historical entry data.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout component with header, navigation tabs, and footer, handling both authenticated and guest user states.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file with no content.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file with no content.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file with no content.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file with no content.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file with no content.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity login state and invalidating queries on identity changes.",
  "frontend/src/hooks/useCombine.ts": "React Query hooks for CRUD operations on NFL combine entries, supporting both authenticated backend storage and guest mode with local storage fallback.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and saving user profiles via the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, muted, destructive, and sidebar variants.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty page component file for adherence history functionality.",
  "frontend/src/pages/CheckIns.tsx": "Empty page component file for check-ins functionality.",
  "frontend/src/pages/combine/Dashboard.tsx": "Combine dashboard displaying quick action cards for new entries, history, and published results, plus latest entry summary and trends panel using combine data hooks.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Detail view for a single combine entry showing all drill results, measurements, benchmark comparisons, and actions to toggle public visibility, share, or delete the entry.",
  "frontend/src/pages/combine/History.tsx": "Displays a paginated list of the authenticated user's combine entries with navigation to individual entry details and a back button to the dashboard.",
  "frontend/src/pages/combine/NewEntry.tsx": "Provides a form to create a new combine entry, validates and parses the form data, saves it via mutation, and navigates to the entry detail page on success.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Displays a public combine entry by ID with performance results and benchmark comparisons, accessible without authentication.",
  "frontend/src/pages/combine/Published.tsx": "Shows a list of all public combine entries from all athletes with navigation to individual public entry pages.",
  "frontend/src/pages/combine/ShareCard.tsx": "Generates a shareable card view of a combine entry with conditional copy-link functionality for public entries or screenshot instructions for private/guest entries.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty page component file for crisis help functionality.",
  "frontend/src/pages/Landing.tsx": "Landing page showcasing NFL Combine Tracker features with login button, guest mode option, and feature cards for tracking, monitoring, comparing, and sharing athletic performance.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty page component file for medication detail functionality.",
  "frontend/src/pages/Medications.tsx": "Empty page component file for medications functionality.",
  "frontend/src/pages/Meetings.tsx": "Empty page component file for meetings functionality.",
  "frontend/src/pages/Onboarding.tsx": "Empty page component file for onboarding functionality.",
  "frontend/src/pages/Program.tsx": "Empty page component file for program functionality.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty page component file for program step detail functionality.",
  "frontend/src/pages/Settings.tsx": "Empty page component file for settings functionality.",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty page component file for data export settings functionality.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty page component file for staying safe functionality.",
  "frontend/src/pages/Today.tsx": "Empty page component file for today's view functionality.",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark thresholds for combine drills and provides a comparison function to categorize performance as elite, above-average, average, or below-average.",
  "frontend/src/utils/combineGuestStorage.ts": "Manages localStorage-based CRUD operations for guest combine entries when users are not authenticated.",
  "frontend/src/utils/combineValidation.ts": "Defines TypeScript interfaces and validation logic for NFL combine form data, including numeric field range validation (height, weight, dash times, jumps, etc.) and helper functions to parse optional numeric inputs.",
  "frontend/src/utils/exporters.ts": "Empty file, likely a placeholder for future export functionality.",
  "frontend/src/utils/reminders.ts": "Empty file, likely a placeholder for future reminder functionality.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/src/utils/userScopedStorage.ts": "Empty file, likely a placeholder for future user-scoped storage functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme settings for sidebar/chart colors, custom animations, font families (Inter, Outfit), and container/border-radius utilities.",
  "project_state.json": "Project metadata tracking the NFL Combine Performance Tracker app's conversion to PWA for iOS installation, listing completed features (manifest, service worker, icons, iOS meta tags) and deployment on Internet Computer blockchain."
}