{
  "backend/main.mo": "Main actor defining all data types (RecoveryStep, Reflection, CheckIn, Medication, DoseLog, Meeting, EmergencyContact, CommitmentsPlan, CallerUserProfile, CombineResult) and state maps for user profiles, check-ins, reflections, medications, dose logs, recovery programs, meetings, emergency contacts, commitments plans, and combine entries with authorization mixin integration.",
  "backend/migration.mo": "Migration module that transforms OldCallerUserProfile to NewCallerUserProfile by adding a hasPaid field defaulted to false for all existing users.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: admin page at /admin route showing all users with payment status, toggle controls for marking users as paid/unpaid, payment gate blocking unpaid users with contact message, and AppShell enforcement of payment checks on every app load.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with admin payment route, Landing page with Zelle payment banner, combine tracker utilities, payment gate integration in AppShell, and useQueries hook with hasPaid status checks.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH-based color system with athletic-themed design tokens (blue/purple primary) for both light and dark modes.",
  "frontend/index.html": "HTML entry point with PWA manifest, iOS PWA support meta tags, and NFL Combine Tracker branding.",
  "frontend/public/manifest.json": "PWA manifest defining NFL Combine Tracker app metadata, icons, display mode (standalone), and theme colors.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first strategy for API calls, with cache cleanup and offline fallback support.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup including routes for combine tracker (dashboard, new entry, history, detail, share, public, published), admin subscription management, and new admin payment management at /admin/payment, plus ProfileSetupDialog integration and ThemeProvider wrapper.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that toggles Internet Identity authentication, showing Sign In/Sign Out states and handling login errors with retry logic.",
  "frontend/src/components/auth/PaymentGate.tsx": "A blocking UI card that displays payment required message with admin contact information (Instagram and phone) and a sign-out option for unpaid users.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog that prompts new users to enter their name and creates a profile with pending subscription status.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file placeholder for check-in editing functionality.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file placeholder for check-in trends visualization.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Displays performance level badges (elite, above-average, etc.) by comparing drill values against NFL combine benchmarks with reference thresholds.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "A comprehensive form for entering NFL combine measurements including body stats, speed drills, jumps, and strength metrics with validation and error handling.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "An SVG-based line chart component that visualizes performance trends over time with improvement indicators and data point labels.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Displays multiple trend charts for key combine metrics (40-yard dash, vertical jump, bench press) by extracting and formatting data from entries.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, navigation, payment gate enforcement, subscription status alerts, and admin badge display with conditional routing.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file placeholder for daily medication dose checklist functionality.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file placeholder for medication entry form.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file placeholder for meeting creation/editing form.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file placeholder for sponsor notes functionality.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file placeholder for safety commitments plan editor.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file placeholder for safety disclaimers display.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication and admin token initialization, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCombine.ts": "Provides React Query hooks for managing combine entry data (athlete measurements and performance metrics), supporting both authenticated users via actor and guest users via local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePaymentAdmin.ts": "Provides admin-focused React Query hooks for listing all users, toggling payment status, and checking individual user payment status via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for user profile operations including fetching caller/user profiles, saving profiles, batch fetching profiles, and checking payment block status.",
  "frontend/src/hooks/useSubscription.ts": "Provides React Query hooks for subscription management including admin user listing, setting user subscription durations, and checking subscription active status.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, accent, destructive, and sidebar color schemes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty component file with no implementation.",
  "frontend/src/pages/Admin.tsx": "Admin panel component for managing user subscriptions, displaying user list with subscription status badges, and providing controls to grant 30-day access or mark subscriptions as expired.",
  "frontend/src/pages/AdminPayment.tsx": "Admin panel for managing user payment status with toggle switches to grant/block access, displaying paid/unpaid user counts and a sortable user table.",
  "frontend/src/pages/CheckIns.tsx": "Empty file with no content.",
  "frontend/src/pages/combine/Dashboard.tsx": "Main dashboard showing quick action cards for new entry, history, and published results, plus a trends panel and latest entry summary.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Detailed view of a single combine entry with measurements, benchmark comparisons, and actions to toggle public/private, share, or delete the entry.",
  "frontend/src/pages/combine/History.tsx": "Lists all user's combine entries in chronological order with summary stats and public/private indicators, navigating to detail view on click.",
  "frontend/src/pages/combine/NewEntry.tsx": "Form page for creating a new combine entry, parsing and validating input data before saving and navigating to the entry detail view.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Displays a public combine entry with athlete measurements, speed drills, power drills, and strength tests, including benchmark comparisons and navigation back to the leaderboard.",
  "frontend/src/pages/combine/Published.tsx": "Renders a leaderboard of all public combine entries with sortable metrics (40-yard dash, vertical jump, etc.) and displays athlete names from user profiles.",
  "frontend/src/pages/combine/ShareCard.tsx": "Provides a shareable card view of a combine entry with copy-to-clipboard functionality for public entries and screenshot instructions for private/guest entries.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty file with no content.",
  "frontend/src/pages/Landing.tsx": "Landing page displaying app features, payment instructions via Zelle, and options to login or continue as guest to the dashboard.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Medications.tsx": "Empty file with no content.",
  "frontend/src/pages/Meetings.tsx": "Empty file with no content.",
  "frontend/src/pages/Onboarding.tsx": "Empty file with no content.",
  "frontend/src/pages/Program.tsx": "Empty file with no content.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Settings.tsx": "Empty file with no content.",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty file with no content.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty file with no content.",
  "frontend/src/pages/Today.tsx": "Empty file with no content.",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark thresholds (elite, good, average) for all combine drills and provides a comparison function to categorize athlete performance levels.",
  "frontend/src/utils/combineGuestStorage.ts": "Manages localStorage-based CRUD operations for guest (unauthenticated) combine entries with auto-incrementing IDs and timestamp tracking.",
  "frontend/src/utils/combineSorting.ts": "Implements sorting logic for combine entries by recency or performance metrics, handling ascending order for speed drills and descending for strength/jump metrics.",
  "frontend/src/utils/combineValidation.ts": "Validates combine form data with range checks for all numeric fields and provides parsing utilities for optional float and integer inputs.",
  "frontend/src/utils/exporters.ts": "Empty utility file, likely a placeholder for future export functionality.",
  "frontend/src/utils/reminders.ts": "Empty utility file, likely a placeholder for future reminder functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from the URL.",
  "frontend/src/utils/userScopedStorage.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and design tokens for a component library with sidebar, chart, and theme support.",
  "project_state.json": "Project state tracking for NFL Combine Tracker with payment-gated access system, documenting existing features for admin user management and payment status enforcement, plus pending feature requests for access control implementation."
}