{
  "backend/main.mo": "Main backend actor defining all data types (RecoveryStep, Reflection, CheckIn, Medication, DoseLog, Meeting, EmergencyContact, CommitmentsPlan, SubscriptionStatus, CallerUserProfile, UserProfileWithPrincipal, CombineResult, CombineState) and initializing state maps for user profiles, check-ins, reflections, medications, dose logs, recovery programs, meetings, emergency contacts, commitments plans, and combine entries with authorization mixin.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing admin page authorization to properly register and verify the first admin Principal ID, and adding user management interface with paid/unpaid status toggles for manual Zelle payment verification workflow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with TanStack Router setup, Landing page with Zelle payment banner, recovery program pages, onboarding flow, user settings utilities, reminder calculations, data exporters, safety disclaimers, check-in trends, medication adherence tracking, commitments plan editor, React Query hooks with new useIsAdmin, AppShell with payment gate, and combine tracker guest storage/validation utilities.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH-based color system with athletic-themed design tokens (blue/purple primary) for both light and dark modes, including sidebar, chart, and destructive color variables.",
  "frontend/index.html": "HTML entry point with PWA manifest, iOS PWA support meta tags, theme color, and description for NFL Combine Tracker application.",
  "frontend/public/manifest.json": "PWA manifest defining NFL Combine Tracker app metadata including name, description, display mode (standalone), theme colors, orientation, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first strategy for API calls, with install/activate lifecycle management and cross-origin request filtering to avoid interfering with Internet Identity authentication.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup defining routes for combine tracker (dashboard, new entry, history, entry detail, share card, public entry, published), admin panel, admin payment management, and profile setup dialog with theme provider and toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity hook with authentication state management, query client clearing on logout, and error handling for already-authenticated edge cases.",
  "frontend/src/components/auth/PaymentGate.tsx": "Displays a payment gate screen blocking access until user sends Zelle payment to admin, showing contact info (Instagram, phone) and logout option.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to enter their name and create a profile with pending subscription status.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file placeholder for check-in editing functionality.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file placeholder for check-in trends visualization.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Displays performance level badges (elite, above-average, etc.) and benchmark thresholds for combine drill results.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "Form component for entering NFL combine measurements including body stats, speed drills, strength tests, and notes with validation.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "SVG-based line chart showing performance trends over time with improvement indicators for combine metrics.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Displays multiple trend charts (40-yard dash, vertical jump, bench press) for combine entry history.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper with header, navigation, subscription status alerts, payment gate enforcement, and admin controls.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file placeholder for daily medication dose checklist.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file placeholder for medication entry form.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file placeholder for meeting entry form.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file placeholder for sponsor notes functionality.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file placeholder for safety commitments plan editor.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file placeholder for safety disclaimers display.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with identity-based authentication and admin token initialization.",
  "frontend/src/hooks/useCombine.ts": "Provides React Query hooks for managing combine entry data (athlete measurements and performance metrics), supporting both authenticated users via backend actor and guest users via local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePaymentAdmin.ts": "Provides admin-focused React Query hooks for managing user payment status, including listing all users, toggling payment status, and checking individual user payment status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile operations including fetching caller/user profiles, batch profile fetching, saving profiles, and checking admin status.",
  "frontend/src/hooks/useSubscription.ts": "Provides React Query hooks for subscription management including admin functions to list users, set subscription durations, and check subscription active status.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including primary, secondary, accent, and sidebar colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty component file for adherence history page (no implementation present).",
  "frontend/src/pages/Admin.tsx": "Admin panel component for managing user subscriptions, displaying user list with subscription status badges, and providing controls to grant 30-day access or mark subscriptions as expired.",
  "frontend/src/pages/AdminPayment.tsx": "Admin panel page that verifies admin authorization via backend actor, displays all users in a table, and allows toggling payment status with a switch control.",
  "frontend/src/pages/CheckIns.tsx": "Empty file with no content.",
  "frontend/src/pages/combine/Dashboard.tsx": "Main dashboard for NFL Combine tracking showing quick action cards (new entry, history, published), latest entry summary, and trends panel component.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Detail view for a single combine entry displaying all measurements, benchmark comparisons, and actions to toggle public/private status, share, or delete the entry.",
  "frontend/src/pages/combine/History.tsx": "Lists all user's combine entries in chronological order with summary stats and public/private badges, navigating to detail view on click.",
  "frontend/src/pages/combine/NewEntry.tsx": "Form page for creating a new combine entry that validates and submits data via mutation hook, then navigates to the created entry's detail page.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Displays a public combine entry with measurements, speed drills, power drills, and strength tests, including benchmark comparisons and a home navigation button.",
  "frontend/src/pages/combine/Published.tsx": "Leaderboard page that displays all public combine entries with sorting options, user profiles, and navigation to individual entry details.",
  "frontend/src/pages/combine/ShareCard.tsx": "Generates a shareable combine card with drill results, supporting both screenshot sharing for private entries and link copying for public entries.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty file with no content.",
  "frontend/src/pages/Landing.tsx": "Landing page displaying app features, payment instructions via Zelle (number 3527348440 to Matt Rossin), login button, and guest access option.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Medications.tsx": "Empty file with no content.",
  "frontend/src/pages/Meetings.tsx": "Empty file with no content.",
  "frontend/src/pages/Onboarding.tsx": "Empty file with no content.",
  "frontend/src/pages/Program.tsx": "Empty file with no content.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Settings.tsx": "Empty file with no content.",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty file with no content.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty file with no content.",
  "frontend/src/pages/Today.tsx": "Empty file with no content.",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark thresholds (elite, good, average) for combine drills and provides a function to compare athlete values against these benchmarks.",
  "frontend/src/utils/combineGuestStorage.ts": "Manages localStorage-based CRUD operations for guest (unauthenticated) combine entries with safe JSON parsing.",
  "frontend/src/utils/combineSorting.ts": "Provides sorting logic for combine entries by various metrics (recent, speed drills, strength drills) with appropriate ascending/descending order.",
  "frontend/src/utils/combineValidation.ts": "Validates combine form data with field-specific min/max ranges and provides parsing utilities for optional numeric inputs.",
  "frontend/src/utils/exporters.ts": "Empty file, likely placeholder for future export functionality.",
  "frontend/src/utils/reminders.ts": "Empty file, likely placeholder for future reminder functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/src/utils/userScopedStorage.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and design tokens for a component library with sidebar, chart, and theme support.",
  "project_state.json": "Project state file documenting an NFL Combine Tracker with manual Zelle payment verification, admin access control, and pending feature requests to fix admin authorization and implement payment-gated sign-in functionality."
}