{
  "backend/main.mo": "Main Motoko actor defining types (RecoveryStep, Reflection, CheckIn, Medication, DoseLog, Meeting, EmergencyContact, CommitmentsPlan, SubscriptionStatus, UserProfile, CombineResult) and state management for recovery program, medication tracking, NFL combine data, and user profiles with authorization mixin.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: admin panel with user payment status table, authentication gate blocking unpaid users, landing page payment instructions, landing page contact information, and contact card page creation.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx routing, Landing.tsx payment banners, recovery program pages, combine tracker utilities, admin panels, contact card components, and authentication hooks.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH-based design tokens defining light and dark mode color variables for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA manifest, iOS meta tags, theme color configuration, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining NFL Combine Tracker app metadata including name, icons (192x192, 512x512), display mode (standalone), theme colors, and orientation settings.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets and network-first strategy for API calls, with cache management on install/activate events.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for landing, combine tracker (dashboard, new entry, history, detail, share, public, published), admin panels (main, payment), and contact card page, wrapped in ThemeProvider and QueryClientProvider.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component using Internet Identity hook to handle login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/auth/PaymentGate.tsx": "Displays a payment gate screen blocking access until user payment is verified, showing Zelle payment instructions and admin contact information with a logout option.",
  "frontend/src/components/auth/PrincipalDisplay.tsx": "Shows the authenticated user's Internet Identity Principal ID in a card with a copy-to-clipboard button.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to enter their name and create their initial profile with pending subscription status.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file placeholder for check-in editing functionality.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file placeholder for check-in trends visualization.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Compares a combine drill result against NFL benchmarks (elite, good, average) and displays the performance level with a badge.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "Comprehensive form for entering NFL combine measurements including body metrics, speed drills, jumps, strength tests, and notes with validation.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "SVG-based line chart component that visualizes performance trends over time for a specific combine metric with improvement indicators.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Displays multiple trend charts (40-yard dash, vertical jump, bench press) for an athlete's combine history.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with navigation header, mobile menu, profile setup dialog, payment gate enforcement, and conditional admin menu items.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file placeholder for medication dose checklist functionality.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file placeholder for medication form functionality.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file placeholder for meeting form functionality.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file placeholder for sponsor notes functionality.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file placeholder for commitments plan editor functionality.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file placeholder for disclaimers functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, handling anonymous and authenticated states with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useCombine.ts": "Provides React Query hooks for managing combine measurement entries, supporting both authenticated users (via actor) and guest users (via local storage), with CRUD operations for athlete performance data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePaymentAdmin.ts": "Provides admin-level React Query hooks for managing user payment status, including listing all users, toggling payment status, and checking individual user payment status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile management (get, save, batch fetch) and admin role verification using the ICP actor.",
  "frontend/src/hooks/useSubscription.ts": "Provides admin hooks for managing user subscriptions, including listing all users, setting subscription durations, and checking subscription active status.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, accent, and sidebar color schemes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty component file for adherence history page (no implementation present).",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page for managing user subscriptions, displaying user list with subscription status badges, and providing controls to grant 30-day access or mark subscriptions as expired.",
  "frontend/src/pages/AdminPayment.tsx": "Admin panel page for managing user payment statuses with authorization checks, displaying a table of all users with toggleable payment switches and subscription status badges.",
  "frontend/src/pages/CheckIns.tsx": "Empty file with no content.",
  "frontend/src/pages/combine/Dashboard.tsx": "Main combine dashboard displaying quick action cards for new entry, history, and published results, plus latest entry summary and trends panel with measurement extraction utilities.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Detailed view of a single combine entry with measurements display, public/private toggle, delete functionality, share options, and benchmark comparison component.",
  "frontend/src/pages/combine/History.tsx": "Displays a list of all combine entries for the authenticated user with navigation to individual entry details and summary stats (40-yard dash, vertical jump, bench press, broad jump).",
  "frontend/src/pages/combine/NewEntry.tsx": "Form page for creating a new combine entry that collects athlete performance data and saves it via mutation, then navigates to the entry detail page on success.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Public view page for a single combine entry that displays all measurements, speed drills, power drills, and strength tests with benchmark comparisons for unauthenticated access.",
  "frontend/src/pages/combine/Published.tsx": "Leaderboard page showing all public combine entries with sortable metrics (40-yard dash, vertical jump, etc.) and user profile integration for displaying athlete names.",
  "frontend/src/pages/combine/ShareCard.tsx": "Shareable card view of a combine entry with copy-to-clipboard functionality for public entries and screenshot-friendly layout for private/guest entries.",
  "frontend/src/pages/ContactCard.tsx": "Contact information management page allowing users to edit their real name, display name, phone, email, Instagram, and additional notes with form validation and save functionality.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty file with no content.",
  "frontend/src/pages/Landing.tsx": "Landing page showcasing NFL Combine Tracker features with payment instructions ($1/month via Zelle), contact information banner, and guest/login options.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Medications.tsx": "Empty file with no content.",
  "frontend/src/pages/Meetings.tsx": "Empty file with no content.",
  "frontend/src/pages/Onboarding.tsx": "Empty file with no content.",
  "frontend/src/pages/Program.tsx": "Empty file with no content.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty file with no content.",
  "frontend/src/pages/Settings.tsx": "Empty file with no content.",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty file with no content.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty file with no content.",
  "frontend/src/pages/Today.tsx": "Empty file with no content.",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark thresholds (elite, good, average) for all combine drills and provides comparison logic to categorize performance levels with descriptions.",
  "frontend/src/utils/combineGuestStorage.ts": "Manages localStorage-based CRUD operations for guest NFL combine entries, including loading, saving, updating, and deleting entries with auto-incrementing IDs and timestamps.",
  "frontend/src/utils/combineSorting.ts": "Provides sorting functionality for combine entries by various metrics (40-yard dash, vertical jump, bench press, etc.) with logic for ascending (speed) vs descending (strength) ordering.",
  "frontend/src/utils/combineValidation.ts": "Validates combine form data with required athlete name and optional numeric fields with min/max ranges, plus helper functions to parse optional float and integer values.",
  "frontend/src/utils/exporters.ts": "Empty file, likely placeholder for future data export functionality.",
  "frontend/src/utils/reminders.ts": "Empty file, likely placeholder for future reminder/notification functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration for maintaining state like admin tokens.",
  "frontend/src/utils/userScopedStorage.ts": "Empty file, likely placeholder for future user-specific storage functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata defining an NFL Combine Performance Tracker with $1/month Zelle payment system, admin controls, leaderboard rankings, social sharing requirements, and strict honor code enforcement."
}