{
  "backend/main.mo": "Main migratable actor implementing user profiles, recovery features, medications, meetings, commitments, and Combine entry storage with access control.",
  "backend/migration.mo": "Migration module upgrading existing actor state by adding empty CombineState while preserving prior user data.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collected short summaries of many frontend files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind CSS theme and color token definitions for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup, theming, and authenticated vs guest routing with profile setup handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic state clearing and status handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting user for their name and saving the profile using a mutation with validation and toast messages.",
  "frontend/src/components/checkins/CheckInEditor.tsx": "Empty file.",
  "frontend/src/components/checkins/CheckInTrends.tsx": "Empty file.",
  "frontend/src/components/combine/BenchmarkComparison.tsx": "Displays benchmark comparison results with badges and benchmark thresholds for a given drill.",
  "frontend/src/components/combine/CombineEntryForm.tsx": "Form for creating or editing combine entries with validation, input fields, and sectioned layout.",
  "frontend/src/components/combine/CombineTrendChart.tsx": "Renders a simple SVG trend chart for combine metrics, including points, labels, and improvement indicator.",
  "frontend/src/components/combine/CombineTrendsPanel.tsx": "Builds trend datasets from entries and renders charts for dash, vertical jump, and bench press.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, navigation, footer, and user identity display.",
  "frontend/src/components/medications/DoseChecklistToday.tsx": "Empty file.",
  "frontend/src/components/medications/MedicationForm.tsx": "Empty file.",
  "frontend/src/components/meetings/MeetingForm.tsx": "Empty file.",
  "frontend/src/components/meetings/SponsorNotes.tsx": "Empty file.",
  "frontend/src/components/safety/CommitmentsPlanEditor.tsx": "Empty file.",
  "frontend/src/components/safety/Disclaimers.tsx": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCombine.ts": "Provides query and mutation hooks for loading, saving, updating, and deleting combine entries for users or guests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, wrapping AuthClient setup, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and save the current user's profile using an actor API.",
  "frontend/src/index.css": "Sets Tailwind base layers and defines light and dark CSS variables for theme colors and layout styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AdherenceHistory.tsx": "Empty placeholder page component.",
  "frontend/src/pages/CheckIns.tsx": "Empty placeholder page component.",
  "frontend/src/pages/combine/Dashboard.tsx": "Displays the combine dashboard with latest entry, navigation cards, and performance trends.",
  "frontend/src/pages/combine/EntryDetail.tsx": "Shows detailed combine entry data with drill stats, sharing, publishing, and deletion actions.",
  "frontend/src/pages/combine/History.tsx": "Displays the user's combine entry history with navigation to individual entries and basic stat previews.",
  "frontend/src/pages/combine/NewEntry.tsx": "Provides a form for creating a new combine entry and saves it via a mutation before redirecting to the entry page.",
  "frontend/src/pages/combine/PublicEntry.tsx": "Shows a public combine entry with detailed drill results and benchmark comparisons.",
  "frontend/src/pages/combine/Published.tsx": "Lists all publicly shared combine entries with quick stat previews and navigation to each public entry.",
  "frontend/src/pages/combine/ShareCard.tsx": "Generates a shareable view of a combine entry with copyable links for public entries and formatted stat display.",
  "frontend/src/pages/CrisisHelp.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Landing.tsx": "Implements the landing page with feature descriptions, guest mode entry, and login options.",
  "frontend/src/pages/MedicationDetail.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Medications.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Meetings.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Onboarding.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Program.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ProgramStepDetail.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Settings.tsx": "Empty placeholder page component.",
  "frontend/src/pages/SettingsDataExport.tsx": "Empty placeholder page component.",
  "frontend/src/pages/StayingSafeOutOfTrouble.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Today.tsx": "Empty placeholder page component.",
  "frontend/src/utils/combineBenchmarks.ts": "Defines benchmark values for combine drills and provides comparison logic to categorize performance levels.",
  "frontend/src/utils/combineGuestStorage.ts": "Implements localStorage-based CRUD operations for storing and managing guest combine entries.",
  "frontend/src/utils/combineValidation.ts": "Defines form data and validation logic for combine measurements, checking required athlete name and numeric ranges, plus helpers for optional number parsing.",
  "frontend/src/utils/exporters.ts": "Empty file placeholder for future exporting utilities.",
  "frontend/src/utils/reminders.ts": "Empty file placeholder for reminder-related utilities.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL or hash parameters, persisting them in sessionStorage, and clearing stored or URL-based values.",
  "frontend/src/utils/userScopedStorage.ts": "Empty file placeholder for user-scoped storage helpers.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores project metadata, features, requirements, and image needs for the NFL Combine tracking app."
}