{
  "kind": "build_request",
  "title": "Fix admin access and implement manual payment gate with Zelle verification",
  "projectName": "NFL Combine Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix admin page authorization to properly register and verify the admin Principal ID. The first user to visit /admin should be stored as the authorized admin, and all subsequent visits should validate against this stored Principal. Ensure the backend correctly persists the admin Principal and the frontend properly waits for authentication before checking admin status.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "Access denied",
          "you're signed in with Internet Identity, visiting the `/admin` page, and seeing 'Access denied'",
          "The backend isn't properly storing your Principal ID as the admin on first visit"
        ]
      },
      "acceptanceCriteria": [
        "Admin can successfully access /admin page after signing in with Internet Identity",
        "First user to visit /admin is automatically registered as the authorized admin",
        "Admin Principal ID is correctly stored in backend state",
        "Authorization check properly validates current user's Principal against stored admin Principal",
        "No 'Access denied' error for authenticated admin user"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Block all sign-in functionality for users who do not have 'Paid' status. Users attempting to sign in without being marked as 'Paid' by the admin must see the error message: 'No sign in without up to date payment'. The sign-in button or Internet Identity flow should only be available to users who have been toggled to 'Paid' status in the admin panel.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-10"
        ],
        "quotes": [
          "No sign in at all without being in 'paid' status and an error message reading 'no sign without up to date payment'",
          "Users trying to sign in without 'Paid' status see error: 'No sign in without up to date payment'"
        ]
      },
      "acceptanceCriteria": [
        "Users without 'Paid' status cannot initiate Internet Identity sign-in flow",
        "Error message 'No sign in without up to date payment' is displayed to unpaid users attempting sign-in",
        "Only users marked as 'Paid' in the admin panel can successfully sign in",
        "Payment status check occurs before allowing authentication flow to proceed"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add user management interface to the admin page that displays all registered users with their current 'Paid' status. Provide toggle controls for each user that allow the admin to mark users as 'Paid' or 'Unpaid'. This enables manual Zelle payment verification workflow where the admin receives Zelle payment, then toggles the user to 'Paid' status, after which the user can sign in.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-10",
          "msg-11"
        ],
        "quotes": [
          "just need access to my admin page to toggle those who make payments via Zelle into 'paid' status",
          "You receive Zelle payment → Toggle user to 'Paid' in admin → User can sign in",
          "Admin page shows all users with toggle controls for 'Paid' status"
        ]
      },
      "acceptanceCriteria": [
        "Admin page displays a list of all registered users",
        "Each user entry shows their current 'Paid' status (Paid/Unpaid)",
        "Toggle control is available for each user to switch between Paid and Unpaid states",
        "Changes to payment status are immediately persisted to backend",
        "Payment status changes take effect immediately for sign-in access control"
      ]
    }
  ],
  "constraints": [
    "Do not integrate Stripe or any external payment processing APIs",
    "Payment verification is manual only - admin receives Zelle payments externally and manually toggles users",
    "Preserve existing NFL Combine Tracker functionality and data structures",
    "Maintain single-actor Motoko backend architecture",
    "Do not modify immutable frontend paths: useInternetIdentity.ts, useInternetIdentity.tsx, useActor.ts, main.tsx, components/ui"
  ],
  "nonGoals": [
    "Automated payment processing or Stripe integration",
    "Zelle API integration",
    "Subscription duration tracking or expiration dates",
    "Email notifications for payment status changes",
    "Payment history or transaction logging",
    "Refund processing"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}