{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin access and implement manual payment gate with Zelle verification",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix admin page authorization to properly register and verify the admin Principal ID",
      "acceptanceCriteria": [
        "Admin can successfully access /admin page after signing in with Internet Identity",
        "First user to visit /admin is automatically registered as the authorized admin",
        "Admin Principal ID is correctly stored in backend state",
        "Authorization check properly validates current user's Principal against stored admin Principal",
        "No 'Access denied' error for authenticated admin user"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update admin page to properly wait for authentication and actor initialization before checking admin status. Add loading state that shows spinner while authentication is in progress. Only perform admin check after identity and actor are both ready. Display clear error messaging if admin check fails after authentication completes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useIsAdmin hook that checks admin status using the isCallerAdmin backend method. Hook should only enable the query when both actor and identity are available. Return loading states that account for both actor initialization and query execution."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Block all sign-in functionality for users who do not have 'Paid' status",
      "acceptanceCriteria": [
        "Users without 'Paid' status cannot initiate Internet Identity sign-in flow",
        "Error message 'No sign in without up to date payment' is displayed to unpaid users attempting sign-in",
        "Only users marked as 'Paid' in the admin panel can successfully sign in",
        "Payment status check occurs before allowing authentication flow to proceed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Add payment status check before allowing login. Before initiating Internet Identity flow, check if the current principal (if already cached/known) has payment status. If attempting to login and payment check returns false, display error toast/alert with exact message: 'No sign in without up to date payment' and prevent the login flow from proceeding. Handle the case where payment status cannot be determined pre-authentication by checking immediately after successful authentication and logging user out if they are not paid."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Add payment validation hook into the authentication flow. After successful Internet Identity authentication, immediately check getUserPaymentStatus backend method. If user is not paid, clear the authentication state and show error message 'No sign in without up to date payment'. Ensure this check happens before any other queries or data fetching occurs."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Update the payment gate logic to enforce payment status check immediately after authentication. If authenticated user lacks payment status, display PaymentGate component and prevent access to any authenticated routes. Ensure payment status is rechecked after any login attempt."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add user management interface to the admin page that displays all registered users with their current 'Paid' status",
      "acceptanceCriteria": [
        "Admin page displays a list of all registered users",
        "Each user entry shows their current 'Paid' status (Paid/Unpaid)",
        "Toggle control is available for each user to switch between Paid and Unpaid states",
        "Changes to payment status are immediately persisted to backend",
        "Payment status changes take effect immediately for sign-in access control"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPayment.tsx",
          "operation": "modify",
          "description": "Enhance the existing admin payment page to display all users with their payment status in a clear table/list format. Show user principal (or name if profile exists), current hasPaid boolean status as a badge (Paid/Unpaid), and a toggle switch for each user. Wire the toggle to call the togglePaymentStatus backend method from usePaymentAdmin hook. Add optimistic updates and refresh the user list after successful toggle. Include loading states during toggle operations and error handling with user-friendly messages."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the /admin/payment route is properly registered and accessible from the admin navigation. Verify that the route is protected by admin authorization check and redirects unauthorized users to the dashboard."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Add navigation link or button to the payment management page (/admin/payment) from the main admin panel. Label it clearly as 'Payment Management' or 'User Payment Status' so admins can easily access the user payment toggle interface."
        }
      ]
    }
  ]
}