{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ensure leaderboard displays all public entries from all users",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Verify that the Published feed page displays all public combine entries from all authenticated users, not just the current user's entries",
      "acceptanceCriteria": [
        "The Published feed shows entries from all users who have made their entries public",
        "Entries are not filtered by the current user's identity",
        "Guest mode entries are excluded from the public feed since they lack stable authentication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/combine/Published.tsx",
          "operation": "modify",
          "description": "Update the Published feed component to call the backend's getAllPublicCombineEntries function instead of filtering by current user. This ensures all public entries from all authenticated users are displayed. Remove any client-side filtering by user identity. The page already maps through entries and displays them as cards, so the main change is updating the data source to fetch all public entries rather than user-specific ones."
        },
        {
          "path": "frontend/src/hooks/useCombine.ts",
          "operation": "modify",
          "description": "Add or update a React Query hook useAllPublicCombineEntries that calls actor.getAllPublicCombineEntries() to fetch all public entries from the backend. Ensure the query is properly typed with CombineResult[] and includes appropriate error handling. This hook should be usable without authentication checks since public entries should be viewable by anyone."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add sorting capability to the Published feed to display entries as a proper leaderboard, with options to sort by different metrics",
      "acceptanceCriteria": [
        "Users can select which metric to sort by from a dropdown or tabs",
        "Entries are ordered with best performances at the top",
        "Default sort order is by most recent entry date"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/combine/Published.tsx",
          "operation": "modify",
          "description": "Add a sorting UI (dropdown or tabs) above the entry list allowing users to select a metric to sort by: 40-yard dash, vertical jump, bench press reps, broad jump, 3-cone drill, 20-yard shuttle, and most recent (default). Implement client-side sorting logic that orders entries with best performances at the top (lowest times for speed drills, highest values for strength/jump metrics). Handle optional fields gracefully by placing entries without the selected metric at the bottom of the list. Update the UI to indicate current sort order and highlight the selected sort option."
        },
        {
          "path": "frontend/src/utils/combineSorting.ts",
          "operation": "create",
          "description": "Create a utility module with sorting functions for combine metrics. Export a sortCombineEntries function that takes an array of CombineResult and a sort key (metric name or 'recent'), returning a sorted array. For speed drills (dash40yd, threeConeDrill, shuttle20yd), sort ascending (lower is better). For strength/jump metrics (verticalJumpInches, broadJumpInches, benchPressReps), sort descending (higher is better). For 'recent', sort by timestamp descending. Handle optional fields by treating undefined/null values as worst performance for that metric."
        }
      ]
    }
  ]
}